#+title: Engraving source blocks
#+latex_engraved_theme: modus-operandi

#+begin_src python :results output :exports both
  print("look ma, some text")
#+end_src

#+RESULTS:
: look ma, some text

#+ATTR_LATEX: :options highlightlines=2
#+begin_src python :results output :exports both 

  print("look, another text")

#+end_src

#+RESULTS:
: look ma, some text

#+attr_latex: :engraved-theme modus-vivendi
#+begin_src sh

  echo "This is shell code"

#+end_src


#+ATTR_LATEX: :options highlightcolor=green,frame=lines,highlightlines=2,numbers=left
#+begin_src sh :exports both

  echo "First"
  echo "This is shell code"

#+end_src

#+RESULTS:
: This is shell code

#+ATTR_LATEX: :options highlightcolor=green,frame=lines,highlightlines=2,numbers=left
#+begin_src elisp :exports both

  (message "AAA elisp")

#+end_src

#+RESULTS:
: AAA elisp

#+ATTR_LATEX: :options highlightcolor=green,frame=lines,highlightlines=2,numbers=left
#+begin_src elisp :exports both

  (message "AAA elisp")

#+end_src

#+RESULTS:
: AAA elisp

#+ATTR_LATEX: :options highlightcolor=green,frame=single,highlightlines=2,numbers=left
#+begin_src elisp :exports both
  (message "AAA elisp")
#+end_src

#+ATTR_LATEX: :options highlightcolor=green,frame=lines,highlightlines=2,numbers=left
#+begin_src elisp :exports both
  (message "AAA elisp")
#+end_src
